In [4]:
import numpy as np
import pandas as pd

In [5]:
obj = pd.Series([4,7,-5,3])

In [6]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.values

array([ 4,  7, -5,  3])

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj.dtypes

dtype('int64')

In [11]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [15]:
sdata = {'Alex': 35000, 'Leon': 71000, 'Chris': 16000, 'Kevin': 5000}
obj3 = pd.Series(sdata)

In [16]:
obj3

Alex     35000
Chris    16000
Kevin     5000
Leon     71000
dtype: int64

In [18]:
obj3.name = 'Salary'
obj3.index.name = 'Names'
obj3

Names
Alex     35000
Chris    16000
Kevin     5000
Leon     71000
Name: Salary, dtype: int64

In [19]:
obj3.index = ['A', 'B', 'C', 'D']

In [20]:
obj3

A    35000
B    16000
C     5000
D    71000
Name: Salary, dtype: int64

In [21]:
data = {'names': ['Alex', 'Alex', 'Alex', 'Leon', 'Leon'],
       'year': [2014, 2015, 2016, 2015, 2017],
       'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)

In [22]:
df

  names  points  year
0  Alex     1.5  2014
1  Alex     1.7  2015
2  Alex     3.6  2016
3  Leon     2.4  2015
4  Leon     2.9  2017

In [23]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
df.columns

Index(['names', 'points', 'year'], dtype='object')

In [25]:
df.values

array([['Alex', 1.5, 2014],
       ['Alex', 1.7, 2015],
       ['Alex', 3.6, 2016],
       ['Leon', 2.4, 2015],
       ['Leon', 2.9, 2017]], dtype=object)

In [26]:
df.index.name = 'Num'
df.columns.name = 'Info'

In [27]:
df

Info names  points  year
Num
0     Alex     1.5  2014
1     Alex     1.7  2015
2     Alex     3.6  2016
3     Leon     2.4  2015
4     Leon     2.9  2017

In [28]:
df2 = pd.DataFrame(data, columns=['year', 'name', 'points', 'penalty'], index=['one', 'two', 'three', 'four', 'five'])

In [29]:
df2

       year name  points penalty
one    2014  NaN     1.5     NaN
two    2015  NaN     1.7     NaN
three  2016  NaN     3.6     NaN
four   2015  NaN     2.4     NaN
five   2017  NaN     2.9     NaN

In [30]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [31]:
df2.columns

Index(['year', 'name', 'points', 'penalty'], dtype='object')

In [32]:
df2.values

array([[2014, nan, 1.5, nan],
       [2015, nan, 1.7, nan],
       [2016, nan, 3.6, nan],
       [2015, nan, 2.4, nan],
       [2017, nan, 2.9, nan]], dtype=object)

In [33]:
df2.describe()

              year    points
count     5.000000  5.000000
mean   2015.400000  2.420000
std       1.140175  0.864292
min    2014.000000  1.500000
25%    2015.000000  1.700000
50%    2015.000000  2.400000
75%    2016.000000  2.900000
max    2017.000000  3.600000